Revit 2026 API

# SpatialElementTagIsOrphaned Property

---

Identifies if the tag is orphaned or not.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsOrphaned { get; }
```
```vb
Public ReadOnly Property IsOrphaned As Boolean
	Get
```
```cpp
public:
property bool IsOrphaned {
	bool get ();
}
```
```fsharp
member IsOrphaned : bool with get
```

#### Property Value

Boolean

The orphan tags are used to tag a spatial element in a link document, but the spatial element was deleted.

#### Reference

SpatialElementTag Class

Autodesk.Revit.DB Namespace